W6D3/first_routes/app/controllers/artworks_controller.rb

    def index
        # debugger
        @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3 WHERE "artworks"."id" = $4  [["title", "Pizza"], ["image_url", "google"], ["artist_id", 68], ["id", 20]]

    def create
        @artwork = Artwork.new(artwork_params)

        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Foood"], ["image_url", "google"], ["artist_id", 68]]