W6D3/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "me@gmail.com"], ["created_at", "2022-06-29 20:28:51.830130"], ["updated_at", "2022-06-29 20:28:51.830130"]]
---
    def create
        user = User.new(new_params)
        if user.save