W6D3/first_routes/app/controllers/users_controller.rb

    def index

        users = User.all.pluck(:username)

        if users.include?(params[:username])
            render json: User.find_by(username: params[:username])
        else
            render json: User.all
---
SELECT "users"."username" FROM "users"
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Andrea "], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Bob"], ["LIMIT", 1]]

    def update
        # debugger
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Fooo"], ["updated_at", "2022-06-30 19:44:23.659998"], ["id", 68]]

    def create
        # debugger
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-06-30 19:49:51.505545"], ["updated_at", "2022-06-30 19:49:51.505545"], ["username", "Foood"]]