W7D3/music_app/app/controllers/bands_controller.rb

    def update
        @band = Band.find(params[:id])
        if @band.update(name: params[:band][:name])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Metallicaasdfas"], ["updated_at", "2022-07-06 20:27:30.150810"], ["id", 1]]